- tab: "Testen"
  testcases:
    - expression: "testen([0,0,1,1],2)"
      return: 2
    - expression: "testen([0,0,1,1],3)"
      return: 3
    - expression: "testen([1,0,1,0],0)"
      return: 0
    - expression: "testen([1,0,1,0],1)"
      return: 1
    - expression: "testen([1,0,1,1],1)"
      return: 1
    - expression: "testen(0,0,1,0],2)"
      return: 2
    - expression: "testen([0,0,1,1],3)"
      return: 3
    - expression: "testen([1,1,1,1],0)"
      return: 0

  
